app/views/restaurants/index.html.haml

      = star_rating(restaurant.average_rating)
    - if restaurant.reviews.any?
---
SELECT  1 AS one FROM "reviews" WHERE "reviews"."restaurant_id" = $1 LIMIT 1  [["restaurant_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]

          %li
            %p= pluralize review.endorsements.count, 'endorsement'
---
SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."review_id" = $1  [["review_id", 27]]