app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def create
    @restaurant = Restaurant.create(restaurant_params)
---
INSERT INTO "restaurants" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "McD's"], ["user_id", 5], ["created_at", "2015-04-01 20:53:56.489999"], ["updated_at", "2015-04-01 20:53:56.489999"]]

  def show
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "restaurants" SET "name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["name", "Curry King"], ["updated_at", "2015-03-31 08:50:06.522628"], ["id", 3]]

  def destroy
    @restaurant = Restaurant.find(params[:id])
    @restaurant.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 2]]