app/controllers/reviews_controller.rb

  def new
    @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    if current_user
      if current_user.has_reviewed? @restaurant
        flash[:notice] = 'You can only write one review per restaurant'
      else
        @restaurant.create_review(review_params, current_user)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("thoughts", "rating", "user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "asdfdsf"], ["rating", 1], ["user_id", 5], ["restaurant_id", 5], ["created_at", "2015-04-01 20:06:09.634082"], ["updated_at", "2015-04-01 20:06:09.634082"]]

  def destroy
    @review = Review.find(params[:id])
    if current_user
      if @review.user_id == current_user.id
        @review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 26]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 26]]